{
    "name": "Richard Nagy",
    "profession": "Full stack software engineer",
    "about": "About",
    "technologies": "Technologies",
    "experience": "Experience",
    "cookieBanner.title": "This website uses cookies",
    "cookieBanner.subTitle": "I use cookies (and similar technoligies) to enhance your browsing experience, serve personalized content, and analyze my traffic. By clicking \"Accept All\", you consent to my use of cookies.",
    "cookieBanner.readMore": "Read More",
    "cookieBanner.customize": "Customize",
    "cookieBanner.acceptAll" : "Accept All",
    "cookieBanner.rejectAll" : "Reject All",
    "cookieBanner.savePreferences" : "Save my Preferences",
    "Necessary": "Necessary",
    "Preferences": "Preferences",
    "Analytics": "Analytics",
    "Consent": "Consent",
    "Cookie Configuration": "Cookie Configuration",
    "Selected language": "Selected language",
    "Selected theme": "Selected theme",
    "Google Analytics": "Google Analytics",
    "consent.description" : "Stores that you already interacted with the cookie consent banner.",
    "cookieConfig.description" : "Stores your cookie preferences.",
    "selectedLanguage.description" : "Stores your prefered language.",
    "selectedTheme.description" : "Stores your prefered theme.",
    "googleAnalytics.description" : "Collects analytical data.",
    "selectLanguage": "Select language!",
    "selectTheme": "Select theme!",
    "Dark IDE": "Dark IDE",
    "Light IDE": "Light IDE",
    "Terminal": "Terminal",
    "allRightsReserved": "All rights reserved",
    "changeCookieSettings": "Change cookie settings",
    "privacyPolicy": "Privacy policy",
    "termAndConditions": "Terms & Conditions",
    "functionList": "Software engineer, technology enthusiast, hobby economist",
    "quote": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.",
    "myAddress": "Budapest, Hungary",
    "dateOfBirth": "June 22, 1995",
    "years": "years",
    "address": "Address",
    "DOB": "Date of Birth",
    "intro.p1": "I'm a profitient software engineer, working as a full-stack web application developer. My mission is to help companies uncage the potential of technology.",
    "intro.p2": "I started professional programming as a student at Obuda University. In the third semester I got my first internship position where I started learning web application development. I wrote my thesis on cross-platform mobile application development, then graduated in 2018. Since then I work full time as a software engineer in different roles.",
    "intro.p3": "During my career I worked on various projects like e-commerce platform and project management tools mainly using Microsoft® technologies. I gathered experience in agile methodologies and Test Driven Development as well.",
    "intro.p4": "At my leisure I'm happy to learn about the economics, take photos and play video games.",
    "backend": "Backend",
    "frontend": "Frontend",
    "database": "Database",
    "misc": "Miscellaneous",
    "seeMore": "See more",
    "seeLess": "See less",
    "quantitativeModelDeveloper": "Quantitative Model Developer",
    "devOpsEngineer": "DevOps Engineer",
    "fullStackDev": "Full Stack Developer",
    "fullTime": "Full Time",
    "partTime": "Part Time",
    "contingent": "Contingent",
    "selfEmployed": "Self Employed",
    "apprenticeship": "Apprenticeship / Student job",
    "internship": "Internship",
    "volunteership": "Volunteership",
    "education": "Education",
    "yr": "yr",
    "yrs": "yrs",
    "mo": "mo",
    "mos": "mos",
    "elte":"Eötvös Lóránd University",
    "oe": "Óbuda University",
    "dobo": "Dobó Katalin High School of Esztergom",
    "GCoE": "General Certificate of Education",
    "BA": "Bachelor of Arts",
    "BSc": "Bachelor of Science",
    "MA": "Master of Arts",
    "MSc": "Master of Science",
    "MBA": "Master of Business Administration",
    "PhD": "Doctor of Philosophy",
    "DSC": "Doctor of Science",
    "DBA": "Doctor of Business Administration",
    "present": "Present",
    "elte.fieldOfStudy": "Business & Economics",
    "oe.fieldOfStudy": "Computer Science Engineering",
    "dobo.fieldOfStudy": "Foreign languages & Information Technology",
    "ms.quantDev.desc": "My responsibility is to support the work of bond traders and desk strats at Morgan Stanley with different reports that help them making trading and risk management decisions. The team I’m a member of works on the development and operation of a software package, that makes it possible, to send automated reports to traders in New York, London, and Tokyo on a daily basis. During this period, I learned some new programing languages and technologies (e.g.: Python, q/KDB), and I also gained knowledge in economics and trading.",
    "avon.devOps.desc": "As a DevOps Engineer I worked on the support and operations of the My Avon Store e-commerce platform. I also participated in the 7/24 On-Call Support.",
    "avon.fullStack.desc": "As part of the My Avon Store Development Team, I worked on the development of Avon's e-commerce platform, using .NET C#, Node.JS, MS SQL, MongoDB and Angular.",
    "abesse.fullStack.desc": "In the course of my work, I was involved in the development and operation of custom software for various enterprises. The methodology of the work varied from project to project; I also participated in waterfall model development, but mostly worked on agile projects. Initially, I worked on the development of a management tool to support the internal processes of a domestic pharmaceutical company, later my task was to optimize and further develop the project management software of an international energy company. I  worked  in  a  DevOps  team  all  the  time,  so  I  managed  to  gain  experience  not  only  in development, but also in operation and support tasks.",
    "ht.fullStack.desc": "My main job was to participate in the development of a customer relationship management (CRM) software. The methodology of the work was Scrum / Agile. During my work, I had the opportunity to participate in several “greenfield” projects. For example, I worked on the project and time management software of a U.S public utilities company, and I also participated in the development of a digital tool for the OBDK (National Center  for  Patients,  Care,  Children’s  Rights,  and  Documentation)  to  collect  mandatory monthly and annual reports from health care facilities. I also had a task to develop a mobile application for HyperTeam CRM, during which I had the good fortune to get to know the Xamarin platform.",
    "printCV": "Print Resume"
}