{
    "name": "Nagy Richárd",
    "profession": "Szoftverfejlesztő mérnök",
    "about": "Rólam",
    "technologies": "Technológiák",
    "experience": "Tapasztalat",
    "cookieBanner.title": "Ez az oldal sütiket használ",
    "cookieBanner.subTitle": "Sütiket (és hansonló technológiákat) használok a böngészési élmény fokozása, testreszabott tartalom szolgáltatása és a hálózati forgalom elemzése érdekében. A \"Mindet Engedélyezem\" gombra kattintva Ön beleegyezik a sütik használatába.",
    "cookieBanner.readMore": "Tudjon meg többet",
    "cookieBanner.customize": "Testreszabás",
    "cookieBanner.acceptAll" : "Mindet Engedélyezem",
    "cookieBanner.rejectAll" : "Mindet Tiltom",
    "cookieBanner.savePreferences" : "Beállítások mentése",
    "Necessary": "Alapvető sütik",
    "Preferences": "Személyre szabás",
    "Analytics": "Analikikai sütik",
    "Consent": "Beleegyezés",
    "Cookie Configuration": "Süti beállítások",
    "Selected language": "Kiválasztott nyelv",
    "Selected theme": "Kiválasztott téma",
    "Google Analytics": "Google Analytics",
    "consent.description" : "Tárolja, hogy Ön már nyilatkozott a sütihasználattal kapcsolatban.",
    "cookieConfig.description" : "Tárolja az Ön sütikell kapcsolatos beállításait.",
    "selectedLanguage.description" : "Tárolja az Ön által választott nyelvet.",
    "selectedTheme.description" : "Tárolja az Ön által választott témát.",
    "googleAnalytics.description" : "Az oldallal kapcsolatos analitikai adatokat gyűjt.",
    "selectLanguage": "Válasszon nyelvet!",
    "selectTheme": "Válasszon témát!",
    "Dark IDE": "Sötét IDE",
    "Light IDE": "Világos IDE",
    "Terminal": "Terminál",
    "allRightsReserved": "Minden jog fenntartva",
    "changeCookieSettings": "Sütibeállítások módosítása",
    "privacyPolicy": "Adatkezelési tájékoztató",
    "termAndConditions": "Használati feltételek",
    "functionList": "Mérnök informatikus, technológia rajongó, közgazdász hallgató",
    "quote": "Bármely féleszű képes a számítógép által értelmezhető kódot írni. A jó programozó olyan kódot ír, amit az emberek is megértenek.",
    "myAddress": "Budapest",
    "dateOfBirth": "1995 június 22",
    "years": "év",
    "address": "Lakóhely",
    "DOB": "Születési idő",
    "workExperience": "Munkatapasztalat",
    "intro.p1": "Tapasztalt mérnök informatikus vagyok, jelenleg full-stack fejlesztőként dolgozom. Küldetésem, hogy segítsek a vállalatoknak kiaknázni a technológiában rejlő lehetőségeket.",
    "intro.p2": "Az Óbudai Egyetem hallgatójaként kezdtem programozni. A képzés harmadik félévében szereztem az első gyakornoki pozíciómat, ahol a webalkalmazás-fejlesztéssel is megismerkedtem. A szakdolgozatomat cross-platform mobilalkalmazás-fejlesztésről írtam. 2018-ban szereztem BSc oklevelet. Azóta teljes munkaidőben szoftverfejlesztő mérnökként dolgozom különböző szerepkörökben.",
    "intro.p3": "Pályám során különféle projekteken dolgoztam, például online kereskedelmi platformon (e-commerce) és projektmenedzsment eszközökön, elsősorban Microsoft® technológiák használatával. Tapasztalatot szereztem továbbá az agilis módszerek és a tesztvezérelt fejlesztés (TDD) területén is.",
    "intro.p4": "Szabadidőmben szívesen foglalkozom közgazdaságtannal, fotózok és számítógépes játékokkal játszom.",
    "backend": "Backend",
    "frontend": "Frontend",
    "database": "Adatbázis",
    "misc": "Egyéb",
    "seeMore": "Több",
    "seeLess": "Kevesebb",
    "quantitativeModelDeveloper": "Kvantitatív modell fejlesztő",
    "devOpsEngineer": "DevOps Mérnök",
    "fullStackDev": "Full stack szoftverfejlesztő",
    "fullTime": "Teljes munkaidős alkalmazott",
    "partTime": "Részmunkaidős alkalmazott",
    "contingent": "Kölcsönzött munkavállaló",
    "selfEmployed": "Önfoglalkoztatott",
    "apprenticeship": "Gyakornok / Diák munka",
    "internship": "Szakmai gyakorlat",
    "volunteership": "Önkéntes",
    "education": "Tanulmányok",
    "yr": "év",
    "yrs": "év",
    "mo": "hónap",
    "mos": "hónap",
    "elte":"Eötvös Lóránd Tudományegyetem",
    "oe": "Óbudai Egyetem",
    "dobo": "Esztergomi Dobó Katalin Gimnázium",
    "GCoE": "Érettségi",
    "BA": "Alapfokozat (BA)",
    "BSc": "Alapfokozat (BSc)",
    "MA": "Mesterfokozat (MA)",
    "MSc": "Mesterfokozat (MSc)",
    "MBA": "Mesterfokozat (MBA)",
    "PhD": "Tudományos fokozat (PhD)",
    "present": "Jelen",
    "elte.fieldOfStudy": "Üzlet & Gazdaság",
    "oe.fieldOfStudy": "Mérnökinformatikus",
    "dobo.fieldOfStudy": "Idegen nyelvek & Informatika",
    "ms.quantDev.desc": "Feladatom, hogy a Morgan Stanley kötvénykereskedőinek és kereskedési stratégáinak munkáját támogassam  különböző  jelentésekkel,  melyek  a  kereskedési  és  kockázatkezelési  döntéseket segítik.  A  csapat,  melynek  tagja  vagyok,  egy  olyan  szoftvercsomagot  fejleszt  és  üzemeltet, amely segítségével, automatizáltan készítünk riportokat nap-mint-nap New York-i, londoni és tokiói  kereskedők  számára.  A  munkám  során  nem  csak  új  programozási  nyelveket  és technológiákat sajátítottam el (pl.: Python, q/KDB), hanem gazdasági és tőzsdei kereskedési ismeretekre is szert tettem.",
    "avon.devOps.desc": "DevOps mérnökként a My Avon Store online kereskedelmi platform támogatásán (level 3 support) és üzemeltetésén dolgoztam, továbbá részt vettem a 7/24 telefonon ügyeletben is (on-call support)",
    "avon.fullStack.desc": "A My Avon Store fejlesztőcsapat tagjaként az Avon online kereskedelmi platformjának fejlesztésén dolgoztam, elsősorban az új piacokon történő bevezetést segítve. Főbb technológiák: .NET C#, Node.JS, MS SQL, MongoDB és Angular",
    "abesse.fullStack.desc": "A munkám során különböző nagyvállalatok számára készített egyedi szoftverek fejlesztésében és üzemeltetésében vettem részt. A munkavégzés módszertana projektenként változott; részt vettem vízesés modell szerinti fejlesztésben is, de többnyire agilis projekteken dolgoztam. Kezdetben egy hazai gyógyszergyártó vállalat belső folyamatait támogató menedzsmenteszköz fejlesztésén  dolgoztam,  később  egy  nemzetközi  energiaipari  vállalat  projektmenedzsment szoftverének optimalizálása és továbbfejlesztése volt a feladatom. Végig  DevOps  csapatban  dolgoztam,  így  nem  csak  fejlesztési,  hanem  üzemeltetési  és támogatási feladatokban is sikerült tapasztalatot szereznem. ",
    "ht.fullStack.desc": "A  fő  feladatom  egy  egyedi  fejlesztésű  ügyfél-kapcsolat  menedzsment  (CRM)  szoftver továbbfejlesztése volt. A munkavégzés módszertana Scrum / Agile volt. A munkám során volt alkalmam több „zöldmezős” projektben is részt venni. Ilyen volt például egy amerikai közmű-szolgáltató vállalat projekt- és munkaidő menedzsment szoftvere, vagy az OBDK (Országos Betegjogi, Ellátottjogi, Gyermekjogi és Dokumentációs Központ) számára készített, az egészségügyi intézmények kötelező adatszolgáltatását segítő eszköz. A feladatom volt továbbá egy mobilapplikáció fejlesztése a HyperTeam CRM-hez, mely során volt szerencsém megismerni a Xamarin platformot.",
    "printCV": "Önéletrajz nyomtatása",
    "404": "404 - Az oldal nem található!",
    "backToHome": "Vissza a kezdő oldalra"
}